In [2]:
import pandas as pd

data = pd.read_csv("C:/Users/user/OneDrive/Desktop/data practice/python/data frames/1.csv")
print(data)

            Name   Age  Gender   Department   Salary
0       John Doe  29.0    Male  Engineering  50000.0
1     Jane Smith  34.0  Female    Marketing  60000.0
2    Emily Davis   NaN  Female  Engineering      NaN
3  Michael Brown  45.0    Male          NaN  80000.0
4  Jessica White  30.0  Female      Finance  70000.0
5      Tom Clark  26.0    Male  Engineering  52000.0
6     Anna Scott   NaN  Female           HR  48000.0
7      Chris Lee  32.0    Male    Marketing      NaN
8   Sarah Walker  29.0  Female      Finance  68000.0
9     David King  40.0    Male  Engineering  75000.0

In [4]:
print(data.isnull())
print(data.isnull().sum())

    Name    Age  Gender  Department  Salary
0  False  False   False       False   False
1  False  False   False       False   False
2  False   True   False       False    True
3  False  False   False        True   False
4  False  False   False       False   False
5  False  False   False       False   False
6  False   True   False       False   False
7  False  False   False       False    True
8  False  False   False       False   False
9  False  False   False       False   False
Name          0
Age           2
Gender        0
Department    1
Salary        2
dtype: int64

In [5]:
print(data.dropna())

            Name   Age  Gender   Department   Salary
0       John Doe  29.0    Male  Engineering  50000.0
1     Jane Smith  34.0  Female    Marketing  60000.0
4  Jessica White  30.0  Female      Finance  70000.0
5      Tom Clark  26.0    Male  Engineering  52000.0
8   Sarah Walker  29.0  Female      Finance  68000.0
9     David King  40.0    Male  Engineering  75000.0

In [6]:
print(data)

            Name   Age  Gender   Department   Salary
0       John Doe  29.0    Male  Engineering  50000.0
1     Jane Smith  34.0  Female    Marketing  60000.0
2    Emily Davis   NaN  Female  Engineering      NaN
3  Michael Brown  45.0    Male          NaN  80000.0
4  Jessica White  30.0  Female      Finance  70000.0
5      Tom Clark  26.0    Male  Engineering  52000.0
6     Anna Scott   NaN  Female           HR  48000.0
7      Chris Lee  32.0    Male    Marketing      NaN
8   Sarah Walker  29.0  Female      Finance  68000.0
9     David King  40.0    Male  Engineering  75000.0

In [8]:
import numpy as np
print(data.replace(np.nan,30000))

            Name      Age  Gender   Department   Salary
0       John Doe     29.0    Male  Engineering  50000.0
1     Jane Smith     34.0  Female    Marketing  60000.0
2    Emily Davis  30000.0  Female  Engineering  30000.0
3  Michael Brown     45.0    Male        30000  80000.0
4  Jessica White     30.0  Female      Finance  70000.0
5      Tom Clark     26.0    Male  Engineering  52000.0
6     Anna Scott  30000.0  Female           HR  48000.0
7      Chris Lee     32.0    Male    Marketing  30000.0
8   Sarah Walker     29.0  Female      Finance  68000.0
9     David King     40.0    Male  Engineering  75000.0

In [13]:
data["Salary"] = data["Salary"].replace(np.nan, 62875)
print(data)
print(data["Salary"].mean())

            Name   Age  Gender   Department   Salary
0       John Doe  29.0    Male  Engineering  50000.0
1     Jane Smith  34.0  Female    Marketing  60000.0
2    Emily Davis   NaN  Female  Engineering  62875.0
3  Michael Brown  45.0    Male          NaN  80000.0
4  Jessica White  30.0  Female      Finance  70000.0
5      Tom Clark  26.0    Male  Engineering  52000.0
6     Anna Scott   NaN  Female           HR  48000.0
7      Chris Lee  32.0    Male    Marketing  62875.0
8   Sarah Walker  29.0  Female      Finance  68000.0
9     David King  40.0    Male  Engineering  75000.0
62875.0

In [10]:
data = pd.read_csv("C:/Users/user/OneDrive/Desktop/data practice/python/data frames/1.csv")
print(data)

            Name   Age  Gender   Department   Salary
0       John Doe  29.0    Male  Engineering  50000.0
1     Jane Smith  34.0  Female    Marketing  60000.0
2    Emily Davis   NaN  Female  Engineering      NaN
3  Michael Brown  45.0    Male          NaN  80000.0
4  Jessica White  30.0  Female      Finance  70000.0
5      Tom Clark  26.0    Male  Engineering  52000.0
6     Anna Scott   NaN  Female           HR  48000.0
7      Chris Lee  32.0    Male    Marketing      NaN
8   Sarah Walker  29.0  Female      Finance  68000.0
9     David King  40.0    Male  Engineering  75000.0

In [17]:
print(data["Salary"].mean())
print(data.bfill)

62875.0
<bound method NDFrame.bfill of             Name   Age  Gender   Department   Salary
0       John Doe  29.0    Male  Engineering  50000.0
1     Jane Smith  34.0  Female    Marketing  60000.0
2    Emily Davis   NaN  Female  Engineering  62875.0
3  Michael Brown  45.0    Male          NaN  80000.0
4  Jessica White  30.0  Female      Finance  70000.0
5      Tom Clark  26.0    Male  Engineering  52000.0
6     Anna Scott   NaN  Female           HR  48000.0
7      Chris Lee  32.0    Male    Marketing  62875.0
8   Sarah Walker  29.0  Female      Finance  68000.0
9     David King  40.0    Male  Engineering  75000.0>

In [18]:
print(data["Salary"].mean())
print(data.ffill)

62875.0
<bound method NDFrame.ffill of             Name   Age  Gender   Department   Salary
0       John Doe  29.0    Male  Engineering  50000.0
1     Jane Smith  34.0  Female    Marketing  60000.0
2    Emily Davis   NaN  Female  Engineering  62875.0
3  Michael Brown  45.0    Male          NaN  80000.0
4  Jessica White  30.0  Female      Finance  70000.0
5      Tom Clark  26.0    Male  Engineering  52000.0
6     Anna Scott   NaN  Female           HR  48000.0
7      Chris Lee  32.0    Male    Marketing  62875.0
8   Sarah Walker  29.0  Female      Finance  68000.0
9     David King  40.0    Male  Engineering  75000.0>